-- TABLE AUTHOR

INSERT INTO author VALUES
(9,'Пауло Коэльо','1947-02-11'),
(10,'Дарья Донцова','1952-06-07'),
(11,'Джоан Роулинг','1965-07-31'),
(12,'Чайлд Ли','1954-10-29'),
(13,'Татьяна Устинова','1968-04-21'),
(14,'Эрих Мария Ремарк','1898-06-22'),
(15,'Владимир Набоков','1899-04-22'),
(16,'Памела Трэверс','1899-08-09'),
(17,'Тестовый автор','1786-02-03'),
(18,'Михаил Юрьевич Лермонтов','1814-10-16'),
(19,'Пушкин Александр Сергеевич','1799-06-06'),
(20,'Борис Акунин','1863-06-25'),
(21,'Теофиль Готье','1865-03-20'),
(22,'Дэвид Вайз','1956-03-01'),
(23,'Джефри Янг','1962-04-02'),
(24,'Чарльз Диккенс','1867-03-06'),
(25,'Николай Лесков','1895-04-04'),
(28,'Новый автор','1111-11-11'),
(29,'Еще автор','1111-11-11');

-- TABLE GENRE

INSERT INTO genre
VALUES (10, 'Детектив'),
       (11, 'Мистика'),
       (12, 'Юмор'),
       (13, 'Исторический'),
       (14, 'Роман'),
       (15, 'Сказка'),
       (16, 'Приключения'),
       (17, 'Бизнес'),
       (18, 'Боевик'),
       (19, 'Религия'),
       (20, 'Компьютеры'),
       (21, 'Семья'),
       (22, 'Психология'),
       (24, 'Биография'),
       (25, 'Вестерн'),
       (26, 'Драма'),
       (27, 'Фэнтези'),
       (28, 'Мемуары'),
       (29, 'Рассказ'),
       (30, 'Пьеса'),
       (31, 'Новый жанр');

-- TABLE PUBLISHER

INSERT INTO publisher
VALUES (8, 'Весь'),
       (20, 'Захаров'),
       (9, 'Эксмо'),
       (10, 'Литер'),
       (11, 'Не русский'),
       (15, 'Издатель Общий');

-- TABLE BOOK

INSERT INTO book
VALUES (5, 'Черный город', NULL, 352, '978-5-8159-1145-1', 10, 20, 2012, 20),
       (6, 'Земля обетованная', NULL, 476, '83-214-0598-3', 14, 29, 1899, 15),
       (7, 'На западном фронте без перемен', NULL, 1056, '978-5-17-082829-6', 14, 14, 1929, 11),
       (14, 'Сказка о золотом петушке', NULL, 98, '978-5-9287-2943-1', 15, 19, 1835, 9),
       (15, 'Три мушкетера123', NULL, 350, '978-5-699-16723-4', 16, 28, 1899, 9),
       (20, 'Икона. Стив Джобс22', NULL, 240, '978-5-91657-374-9', 17, 11, 2012, 9);

